{
  "document_id": "25faff3a-68ef-4902-81ef-db9157c7c2ed",
  "chunks": [
    "Department of Computer Science and Engineering \n \nC.V. Raman Global University, Bhubaneswar \n \nCERTIFICATE OF APPROVAL \n \nThis is to certify that we have examined the project entitled \" A case study of \nbiodiversity in ODISHA\" submitted by PALLAVI, ANJALI, SIJOLSONI, ADITYA, \nSAPNA, GOURAV, OMPRAKASH, ARPITA, SEETAL, DIVANSHU. \n \n \nWe here by accord our approval of it as a project work carried out and presented \nin a manner qual for to acceptance for the partial fulfillment for the Bachelor",
    "Degree of Technology for which it has been submitted. The approval does not \nnecessarily endorse or accept every statement made, opinion expressed or \nconclusions drawn as recorded in this major project, it only signifies the acceptance \nof the major project for the purpose a has been submitted \nThe Content or mater presented in the thesis have not been submitted anywhere \nfor award of any other degree. \nThis is to certify that the above statement is correct to the best of our knowledge.",
    "(Dr. Neelanjana choudhury) \n          Advisor",
    "ACKNOWLEDGEMENT \n \nWe would like to articulate our deep gratitude to our project guide Dr. \nNEELANJANA CHOUDHURY, Assistant Professor, Department of \nAgriculture & Allied science who has always been a source of \nmotivation and firm support for carrying out the project. We also \nexpress our gratitude to her for his invaluable suggestion and \nencouragement all through the project work. constant \n \nAn assemblage of this nature could never have been attempted with",
    "our reference to and inspiration from the works of others whose details \nare mentioned in the references section. We acknowledge our \nindebtedness to all of them. Further, we would like to express our \nfeeling towards our parents and God who directly or indirectly \nencouraged and motivated us during this dissertation.",
    "Project Report on Biodiversity in Odisha \n \nPresented By …. \nPallavi Kumari…………………………………………………………….20010552  \nAnjali Kumari……………………………………………………………..20010470  \nSijol Soni Sahoo.…………………………………………………………20010468  \nAditya Saumya.……………………………………………………….….20010473  \nSapna Rani………………………………………………………………….20010449  \nGourav Swain……………………………………………………………..20010454 \nOm Prakash Mohanta…………………………………………………20010448  \nArpita Patra………………………………………………………………..20010287",
    "Arpita Patra………………………………………………………………..20010287  \nSeetal Subhadarshini Swain………………………………………..20010464  \nDivanshu Nayan………………………………………………………….20010462 \nGuided By… \nDr. Neelanjana Choudhary \nAsst. Professor \nDepartment of Agriculture & Allied Sciences \nC.V. Raman Global University, BBSR, Odisha"
  ],
  "created_at": "2025-09-21 16:17:16.346515"
}