{
  "document_id": "ee5a2714-7425-475e-8c0f-1df51bbb89da",
  "chunks": [
    "Rohit Kumar \nlinkedin.com/in/rohit-kumar-202729219 \nrk9006007262@gmail.com \n+91-9031995440 \nJuly 25, 2025 \nDear Hiring Manager, \nI am writing to express my interest in the Software Engineer role at Microsoft. With a \nstrong foundation in distributed systems, backend development, and incident response, \nI am eager to contribute to Microsoft’s mission of building resilient, planet-scale \ninfrastructure that supports billions of global users.",
    "In my current role as a Software Developer at Go Digit Life Insurance, I work closely \nwith systems that demand high availability and real-time responsiveness. I have \ndesigned and deployed microservices using Java and Spring Boot, optimized \nPostgreSQL queries for sub-second latency, and built a Kafka-based event processing \nsystem that handles over 500K messages per day with 99.9% reliability. Additionally, I \nhave improved incident resolution time by 60% by implementing automated runbooks,",
    "health checks, and real-time monitoring with Prometheus and Grafana. \nMy academic and personal projects have reinforced my expertise in system design and \nlarge-scale architectures. For example, I developed a real-time fraud detection system \nusing Kafka Streams and Spark, a distributed URL shortener with 1M+ monthly hits, \nand a secure file storage platform using MinIO. These initiatives not only strengthened \nmy skills in C++, Python, and cloud-native technologies, but also deepened my",
    "understanding of fault tolerance, load balancing, and observability in complex systems. \nI am particularly drawn to this role because of Microsoft’s focus on reliability \nengineering and rapid incident response within globally distributed systems. The \nopportunity to work on first-responder systems and collaborate with experts to ensure \nhigh availability and performance at scale excites me. I am also enthusiastic about",
    "contributing to innovations like Copilot, LLM-powered services, and secure enterprise \nintegrations with platforms such as SAP and ServiceNow. \nI bring to the table strong problem-solving skills, a growth mindset, and a deep \ncommitment to service excellence. I would be honored to join Microsoft in building \nresilient systems that empower people and organizations around the world. \nThank you for considering my application. I look forward to the opportunity to discuss",
    "how my background and experience align with Microsoft’s vision. \nSincerely, \nRohit Kumar"
  ],
  "created_at": "2025-10-01 13:56:50.963202"
}