{
  "document_id": "025feb75-ea2a-44f1-abb4-cddcc849e10d",
  "chunks": [
    "Rohit Kumar \nlinkedin.com/in/rohit-kumar-202729219 \nhttps://github.com/Rohit00sketch \nrk9006007262@gmail.com \n+91-9031995440 \nJuly 27, 2025 \nDear Hiring Manager, \nI am writing to express my interest in the Senior Software Engineer position at your \norganization. With over 2 years of experience in backend development, distributed \nsystems, and production-grade microservices, I am excited by the opportunity to \ncontribute to a product delivery team focused on innovation, performance, and",
    "scalability. \nIn my current role at Go Digit Life Insurance, I have designed and delivered resilient \nmicroservices using Java, Spring Boot, and PostgreSQL, supporting high availability \nand low-latency requirements. I also developed a Kafka-based event processing pipeline \nthat handles over 500K messages/day with 99.9% reliability. I actively monitor system \nhealth using Prometheus and Grafana, and implemented automated runbooks and",
    "alerting workflows, reducing incident resolution time by 60%. \nBeyond backend expertise, I’ve worked on building and maintaining frontend \ncomponents using Angular, with a focus on usability and performance. My experience \nwith OAuth 2.0 and secure authentication flows ensures that I can develop robust, user-\nsafe systems end to end. \nI’ve also led sprint planning, conducted detailed code reviews, and mentored junior",
    "engineers to uphold engineering best practices. My ability to identify technical debt, \npropose improvement strategies, and take ownership of production issues aligns well \nwith your team's goals. In addition, I have experience containerizing applications with \nDocker and deploying services in Kubernetes environments, further enabling scalability \nand reliability. \nWhat draws me most to this opportunity is the balance between technical ownership",
    "and team collaboration—contributing to architectural discussions, refining \nimplementation details, and delivering secure, high-performance features. \nI would welcome the chance to contribute to your mission-driven engineering culture \nand bring in my skills to improve product delivery and operational excellence. Thank \nyou for considering my application. I look forward to the opportunity to speak with you \nfurther. \nSincerely, \nRohit Kumar"
  ],
  "created_at": "2025-10-01 14:05:59.900609"
}