{
  "document_id": "98f511f5-e91c-410b-b6d8-1df00e6e6a32",
  "chunks": [
    "Bio-Diversity In Odisha \n \nBiodiversity or Biological Diversity is defined as the variability among \nliving organisms which includes floral, faunal, and microbial diversity. \nOdisha's unique location in Peninsular India has blessed it with an \ninteresting assemblage of floral and faunal diversity. Odisha state is \nsituated on the east coast of the country, it covers an area of 1,55,707 \nsq. km which is 4.74% of the geographical area of the country. The",
    "State lies between 17°47'N to 22°34'N latitude and 81°22'E to 87°29'E \nlongitude and shares borders with West Bengal, Jharkhand in the north, \nChhattisgarh in the west, Andhra Pradesh in the south, and Bay of \nBengal in the east. Physiographically, the State can be divided into four \nregions, viz, Northern Plateau, Eastern Ghats, Central Tableland, and \nCoastal Plains. The annual rainfall ranges from 1,200 mm to 1,600 mm \nand the annual temperature varies from 12°C to 42°C. The State is",
    "drained by many important rivers, which include Subarnarekha, \nBrahmani, Baitarni, Mahanadi, Devi, and Rushikulya. The State has 30 \ndistricts, among which 12 are tribal districts. Being situated in the \nEastern part of India covering three biogeographic provinces, the state \nof Odisha is bestowed with various natural ecosystems like agrarian, \nforests, wetlands, and grasslands. About 37% of the state’s \ngeographical area is covered with forests and is credited with five of the",
    "sixteen major forest types occurring in India. Primarily, major forests \nare Northern tropical semi-evergreen forest, tropical moist deciduous \nforest or monsoon forest, Tropical dry deciduous forest, and Tidal \nmangrove forest. The important aromatic plants include Kiya (Pandanus \nfascicularis), Sal (Shorea robusta), Vetiver (Vetiveria zizanioides), Wild \nlemongrass, and Hyptiss wavelns. Odisha is the second-largest Non-\nTimber Forest Producing state in India and 37% of its population",
    "depend on Non-Timber Forest Produces like leaves, tubers, seeds, \nfruits, mushrooms, and medicinal plants for their day to day \nrequirements and up to 40% of the income of the rural people comes \nfrom the selling of forest products.",
    "To protect and conserve the fragile natural resources, the state \ngovernment has created 19 wildlife sanctuaries, one national park and \none proposed national park, one biosphere reserve, and two Tiger \nReserves in the entire state. These Protected Areas comprise 10.37% of \nthe total forest area and 4.1% of the total geographical area of Odisha. \nNatural barriers like the mangroves and their associate, the sand dunes, \nthe seaweeds and seagrasses, the screw pines, the Casuarinas, and the",
    "cashew plantations together formed a coastal bio-shield and protects \nthe Odisha coast from natural calamities. \nThe state is an abode for over 5174 species of plants and fungi including \n2800 species of higher plants together with 300 species of grasses, 153 \nspecies of orchids, 178 species of pteridophytes, 22 species of \ngymnosperms, 63 species of mangroves and their associates, 24 species \nof seaweeds, 7 species of seagrasses, 17 species of carnivorous plants.",
    "About 300 species of bryophytes, 275 species of lichens, and above \n1000 species of fresh, marine, and brackish water algae contributes to \ncryptogam diversity. Thirty species of wild edible mushrooms and",
    "above 450 species of macro-fungi, 300 species of wild relatives of crop \nplants, and 500 species of medicinal plants also occur in Odisha. Around \n117 plant species including 41 medicinal plant species of the state are \nconsidered as threatened and 24 species are endemic to Odisha, out of \nit 7 species each are orchids and grasses. While Saraca asoca and \nSymplocos recemosa comes under critically endangered category, \nLitsea glutinosa, Oroxylum indicum, Blepharispermum subsessile, and",
    "Embelia ribes are becoming endangered in the state. To protect the \nmedicinal plants of Odisha, 8 Medicinal Plant Conservation Areas have \nbeen created. \n \nOdisha is having unique biogeographic features, which supports a large \ndiversity of animals. The faunal resources comprise 114 species of \nMammals (103 wild and 11 domestic), 537 species of Birds, 131 species \nof Reptiles, 29 species of Amphibians, about 800 species of Pisces, 584",
    "species of Crustaceans, 366 species of Molluscs, 259 species of \nColeoptera, 98 species of Diptera, 265 species of Hymenoptera, 112 \nspecies of Spider, about 300 species of Lepidoptera, 102 species of",
    "Odonata and 31 species of Isopteran. A total of 65 globally threatened \nfaunal species are reported to occur in the state which includes 26 \nspecies of birds, 20 species of mammals, 18 species of reptiles, and one \nspecies of fish. \n \nLocal communities have been engaged themselves in protecting many \nplant and animal taxa in different parts of the state. Conservation of \nBlackbuck in Bhetnoi- Balipadar of Buguda block in Ganjam, protection",
    "of endemic Mahseer fish of Mahanadi at Huma and Maneswar in \nSambalpur, conservation of tortoise in Gajapati and conservation of \nfresh water turtles in Champeswar, Athgarh and Golia in Ganjam are \nsome of the examples. The three mass nesting beaches of Olive Ridley \nSea turtles including Gahirmatha, Devi, and Rushikulya located along \nthe Odisha coast are of great significance. Living fossils such as two \nspecies of Horseshoe crab (Tachypleus gigas and Carcinoscorpius",
    "rotundicauda) widely found along the Odisha coast may have existed \nlong before the arrival of dinosaurs. Three Elephant Reserves, 8 \nimportant bird areas, several thousands of sacred grooves of the state",
    "have immensely contributed to wildlife conservation in Odisha. \nEndangered Irrawaddy dolphins and lakhs of migratory birds of Chilika \nLake, saltwater crocodile (Crocodylusporosus) of Bhitarkanika, Muggers \nof Similipal and Gharials of Tikarpara have international repute. A place \nlike Bhitarkanika, Chilika (Nalabana), and Manglajodi is heaven for birds \nduring the winter season and numerous winter migratory species visit",
    "annually. Besides these, shorebirds along the coast, different decapods, \ndragonflies, damselflies, butterflies, sand wasp in sand dune sites are of \nutmost wildlife importance. \nAgricultural biodiversity is an important component of general \nbiodiversity which includes all variety and variability of animals, plants, \nmicro-organisms and ecosystems which are necessary to sustain key \nfunctions of the agroecosystem, its structure and processes for food",
    "production and food security. Biodiversity is tightly linked to agriculture \nand its various components. Various plants, animals and numerous \nmicroorganisms are closely associated with the agro-ecosystem and \nhelp agricultural crops in every stage such as production, protection \nand improvement. \nThe diverse agro-climatic zones of the state favor cultivation of several \ncrop varieties of which rice, pulses, oilseeds, jute, sugarcane, coconut,",
    "wheat, small millets, bajra, arhar, groundnut, castor, linseed, cashew \nand turmeric are of great significance. Several varieties of turmeric \nfrom Kandhamal district, Millets of Koraput and Maize of Gajapati \ndistrict are of special importance at the national and international \nmarket.  Tuber crops like Taro, Elephant Foot Yam, Greater Yam and \nSweet potato are cultivated in the tribal belts of Odisha are the major \nsource of livelihood for them. Being the secondary center of origin of",
    "cultivated rice, Odisha has the distinction of possessing about 15,000 \ntraditional rice varieties out of 50,000 found in the world.  \nAcknowledging the years of efforts of tribal people in conserving 130 \nvarieties of indigenous cultivars of rice, Koraput district was declared as \na Globally Important Agricultural Heritage System by Food and \nAgricultural Organization (FAO) in 2012.",
    "Similarly, around 41 different indigenous breeds of domestic animal \nand birds including the Ghumsuri cattle, Chilika buffalo, Ganjam goat, \nKendrapada sheep, etc are designated breeds for Odisha. About 22 \nsuch breeds have been registered in the National Bureau of Animal \nGenetic Resource, New Delhi. These indigenous breeds need to be \nprotected and conserved to develop new and more improved varieties \nof domesticated animals in the future.",
    "of domesticated animals in the future. \n \n \nBiodiversity is therefore the natural biological  \ncapital for our life support system on the planet Earth.  \nOur survival depends on the web of  life created by  \nthe interactions of the millions of different animals,  \nplants, fungi, and other microscopic organisms that  \nshare the Earth with us. All of  these species together  \nmake up our natural heritage, which we call biological  \ndiversity, or \"biodiversity.\" Because of  human",
    "diversity, or \"biodiversity.\" Because of  human  \nactivities that pollute or destroy natural habitats, we",
    "are losing species at an alarming rate. We are, so to  \nspeak, erasing nature's hard drive without even  \nknowing what data it contains. The aim of  the  \nConvention on Biological Diversity (CBD) and its 190  \nContracting Parties is to significantly reduce the loss  \nof biodiversity by 2010. This goal can only be achieved  \nthrough the concerted of all sections both national  \nand international alliances between policy makers,  \nscience, the public and business. \nBiodiversity Hotspots",
    "Biodiversity Hotspots \nThe Eastern Himalayas, including parts of  \nNepal, India and Bhutan; the Western Ghats in India  \n(mountain ranges running along west coast of  India  \nup to the southern tip); and the Western Ghats in Sri  \nLanka have the distinction of being designated as  \nthree of the 25 biodiversity hotspots in the world. \nThe mountains of  the Western Ghats of  south-  \nwestern India representing one of the eight bio- \ngeographical zones of the Indian subcontinent, two",
    "main centers of  diversity, the Agastyamalai hills and  \nSilent Valley in the Indian Western Ghats, are home  \nto nearly one-third of all the flowering plants found  \nin India. Of this, nearly 40 % is endemic. The faunal  \ndiversity of the region includes 146 species of  \namphibians (116 or 80 % are endemic); 259 of reptiles  \n(161 or 62 % endemic); 528 of birds (7.5 % endemic);  \nand 140 of  mammals (38 or 27 % endemic). Total  \nnumber of terrestrial vertebrate species stands at",
    "1,073 (355 or 33 % endemic), and of vascular plant  \nspecies at 4,780 (2,180 or 45 % endemic). The fauna  \nincludes the tiger, leopard, sloth bear, barking deer,  \nmouse deer, Nilgiri langur, Lion-tailed macaque,",
    "Nilgiri tahr, Spotted deer, Giant squirrel, etc. The  \nIndian portion of  the Western Ghats is also home to  \n250 species of orchids, of which 100 are endemic  \nand 150 species of  grasses. The Western Ghats act as  \nthe gene bank of mycorrhizal fungi (13,000 species)  \nas well. \n \nThe Eastern Himalayas comprise of tracts of  \nthe Darjeeling hills, Sikkim and Arunachal Pradesh  \nin India and eastern Bhutan. Subtropical forests cover  \nthe land up to 2,000 m; beyond it laid the temperate",
    "mixed forests, mainly comprising of fir, juniper and  \nrhododendron. The eastern Himalayas are home to a  \nlarge number of endemic fauna including the Slow  \nLoris, One-horned Rhinoceros, Golden langur, Tiger, Indian civet, Red \npanda, Snow leopard, Clouded  \nleopard and golden cat. Birds include the snow pigeon,  \nsnow cock, white-winged wood duck, pheasants, bar-",
    "headed geese and the black-necked crane. The region  \nis particularly rich in endemic plant species. The  \nIndian part of the eastern Himalayas accounts for  \nabout 5,800 plant species of which about 2,000(36%  \nare endemic). In India, Sikkim alone accounts for 4,250  \nplant species of which 2,550 (60 % are endemic). Of  \nthe 12,000 plant species found in Nepal and Bhutan,  \n1,300 are endemic to the eastern Himalayan region. \nThe Eastern Ghats too display a rich floral",
    "The Eastern Ghats too display a rich floral  \ndiversity, with about 2,000 species of  flowering plants  \n(angiosperms), few gymnosperms such as Cycas and  \nGnetum scandens, and 30 species of  ferns. The floral  \ndiversity in this region is threatened, though some rare  \nplants and trees still survive. Among these are  \nAndrographis beddomei, Andrographis nallamalayana,  \nDicliptera beddomei, Brachystelma glabrum, Brachystelma  \nvolubile, Boswellia ovalifoliolata, Chrysopogon velutinus,",
    "Pimpinella tirupatiensis and Cycas beddomei. (Rajamani,  \n1998). \nOrissa's biodiversity \nOrissa ranks fourth amongst State/Union  \nTerritories of  the country in terms of  area under forest  \ncover. The total forest area of  the State is 58,135  \nsq.km. which is 37.34% of the State's geographical  \narea and about 7.66% of  country's forests.Orissa host  \nrich biodiversity in variety habitats. The largest  \nRamsar sites (Brackish water Chilka lake and the",
    "mangrove forests of Bhitarkanika), which attract the  \nlargest population of migratory birds from very distant \nlands, the largest egg laying beaches of  Gahirmatha  \nfor Olive Ridley Sea turtles, some of India's closed  \ngreen forests, floral and faunal diversity of Similipal",
    "biosphere, rich medicinal plants in Similipal and  \nGandhamardan forest ranges and many tribal races  \nof people are also found in the state of Orissa. \n \nMajor biodiversity hotspots in Orissa  \nSimilipal Biosphere Reserve: \nThe uniqueness of Similipal as hot spot of  \nbiodiversity lies with the geological formation, phyto  \nsociological feature and climatic situation of the area.  \nThe area lies on the northern limit of Deccan plateau  \nand Southern limit of lower gangetic plains adjoining",
    "Chhot Nagpur high lands. Similipal, practically is a  \nvery large ecotonal zone with an annual rainfall  \nvarying from 1200 cm to 2000 cm. The Similipal  \nmassif has an average height of about 550 m, the  \nsteeper slopes towards southern and east and the  \ngradual sloping terrain towards north and west. The",
    "soil contains volcanic lava which holds large amount  \nof ground water and feeds the waterfalls and river  \nsystems. Similipal was a part of  Gondwana land in  \nthe Paleozoic era and the rocks are Metamorphosed,  \nSedimentary and Igneous. The unique position of  the \nmountain range acts as a barrier to south west  \nmonsoon and brings heavy rain to the area and  \nmoisture loaded wind moves to south-west region of  \nthe state bringing rain to south western region of",
    "Orissa. It is rightly said that, \"Similipal to Orissa, part  \nof Bengal and Bihar is as the Himalayas to India\".  \nThe Biosphere reserve comprises northern tropical  \nsemi ever green forest, northern tropical moist \ndeciduous forest, dry deciduous hill forests, high level  \nsal forests, grass land and Savannah. The Biosphere  \nreserve is abode of  1076 species of  plants, 94 sp. of  \norchids, 12 sp. of  amphibians, 29 sp. of  reptiles, 264  \nsp. of  birds and 42 sp. of  mammals. Endemism is",
    "very high among tree ferns, orchids and many other  \nplants and among invertebrates specially insects. The  \nmodel eco race of  tassar silk worm Antheraea mylitta  \nand A. paphia are unique to Similipal. Tiger population  \nis over 50% of the entire tiger population of Orissa  \nstate and the Elephant population is the largest in  \nCentral India. The Chawsingha deer and the giant  \nsquirrel are common in Similipal and also harbour  \nmore than 200 sp. of  medicinal plants. Many of  the",
    "IUCN endangered, vulnerable and threatened species  \nand animals and wildlife listed under Schedule-I of  \nIndian Wildlife Act, 1972 are found in Similipal. \nWestern Orissa: \nThe western region of Orissa includes the",
    "important Gandhamardan forests and the forests of  \nBadrama forest range. These areas are very rich in  \nbiodiversity, both floral and faunal diversity. The  \nfamous Hirakud dam reservoir is also located in this  \nregion and attracts lakhs of  migratory birds in winter.  \nBadrama forest range comprises of 120 species of  \nplants belonging to 46 families. The forest tree  \nvegetation is categorised as Shorea terminalia. The area  \nis also significant for large wildlife. The",
    "is also significant for large wildlife. The  \nGandhamardan hill range harbour very rich medicinal  \nflora. The area comprises semi ever green forests, dry  \ndeciduous dense forest, bamboo forests, dry deciduous  \nopen forests, scrub wood land, barren rocky areas etc.  \nand the common plant species are; Acacia torta,  \nAlbizzia procera, Albizzia odoratissima, Adina cordifolia,  \nCareya arborea, Diospyros melanoxylon, Diospyros montanna,  \nMangifera indica, Mitragyana parviflora, Tamarindus",
    "indicus, Terminalia arjuna, T. tomentosa etc. and other  \ndeciduous species like Anogeissus latifolia, Buchanania  \nlanzan, Haldina cordifolia, Madhuca indica, Cleistanthus  \ncollinus, Terminalia alata and many others with  \nDendrocalamus strictus forming the upper storey. The  \nmiddle storey is composed of  small trees and shrubs  \nof which Andisia salanacea, Cassia fistula, Emblica  \nofficinalis, Cpiadessa baccifera and Holarrhena  \nantidysenterica are predominant. \nChilika Lagoon:",
    "Chilika Lagoon: \nIt is situated on the east coast of India from  \nSouthwest corner of Puri and Khurda districts to the  \nadjoining Ganjam District in the state of Orissa. It is  \nthe larget brackish water lagoon in Asia with estuarine  \ncharacter and the largest wintering ground for",
    "migratory water-fowls found on the Indian sub-  \ncontinent. It is one of the biodiversity hot spots of  \nthe country, and some rare, vulnerable and endangered  \nspecies listed in the IUCN Red List of threatened  \nanimals inhabit the Lake area for at least a part of  \ntheir life cycle. This list includes a number of rare,  \nthreatened and endangered species such as Irrawady  \ndolphins (Orcella brevirostris) and the limbless skink  \n(Barakudia insularis).",
    "(Barakudia insularis). \n \nThe lagoon is a highly productive ecosystem with rich in Chilika crabs \n(Scylla serrata)etc., Prawns (Penaeus monodon, P.indicus) and many \nvariety of fishes etc. are important faunal component. Based  \non its rich biodiversity, Chilika Lagoon was designated  \nby the Government of India as a Ramsar Site in 1981,  \nespecially as an important Water-fowl habitat.  \nNalabana Wildlife Sanctuary covering an area of  \n15.53 sq.km. within Chilika was notified in 1987 as a",
    "Wildlife Sanctuary under the Wildlife Protection Act.  \nNalabana literally means \"forest of reeds\" that is  \ncovered with aquatic plants, predominant species  \nbeing Phragmites karka.  At the beginning of the  \nmigratory season in October-November, long legged  \nwaders and diving species are predominant.  \nSubsequently, small wading species congregate on the  \nisland. A large flock of flamingoes feeding in the  \nshallow waters of  the Lagoon is most fascinating. \nBhitarkanika Mangrove:",
    "Bhitarkanika Mangrove: \nThe mangrove forest of Bhitarkanika in the  \nBrahmani-Baitarani-Dhamra rivers deltaic regions  \ncomprise a single continuous and compact forest  \npatch and is the second largest compact patch of  \nmangroves after Sunderban of  West Bengal. Being a  \ndeltaic region, the area bears large number creeks and  \nrivulets. These are considered to be a serial sub-type  \nunder the Tropical semi-evergreen forest type with  \nvivipary germination. In respect of  species diversity,",
    "probably the mangroves of Orissa rank first in India.",
    "The common species of mangrove are Avicennia alba,  \nBruguiera parviflora, Bruguiera cylindrica, Aegialites  \nrotundifolia, Lumnitzera racemosa, Sonneratia griffithii,  \nSonneratia alba, Ceriops tagal, Aegialites rotundifolia,  \nXylocar pus granatum, Excoecaria agalocha, Heritiera fomes,  \nAcanthus ilicifolius, Merope angulata, Dalbergias spinosa. \nThe climbers noticed in mangrove forests are Finlaysonia  \nobovata, Derris trifoliate, Tylophora tenuissima and Sarocolobus",
    "globosus.The vertebrate fauna of this area is also very  \nrich and harbours the King cobra (Ophiophagus hannah),  \nKraits, Python, Salt water crocodile (Crocodyldus  \nporosus) and Olive Ridley Sea Turtles (Lepidochelys  \nolivacea), water monitor (Varanus salvator), Horse-shoe  \ncrabs(1) Tachypleus gigas (2) Carcinocor pious rotincauda.  \nBesides Leopard, Striped hyaena, Chital, Deer,  \nSambar and wild Boar are found in the Bhitarkanika  \nsanctuary. Among the small mammals, common",
    "mongoose, Smooth coated Indian Otter, the small  \nIndian Civet, common palm civet, Grey musk shew,  \nthe striped palm squirrel, the Indian porcupine, short  \nnosed fruit bat, Indian pipistrelle and Temminck,  \nfiddler crab (Envis 2009) and mud skippers are also  \nfound. In Gahirmatha coastal waters, back waters and  \nestuaries, the gangetic dolphin, Humpback dolphin,  \nIrrawady dolphin and the little Indian finless porpoise  \nare found. These aquatic mammals are scheduled",
    "are found. These aquatic mammals are scheduled  \nanimals as per The Wildlife (Protection) Act, 1972.  \nSome 156 species of birds are also found in the  \nsanctuary. The sanctuary has been declared as a  \nNational Park (145 sq.km. area) and recently been  \ndeclared as a \"Ramsar Site\". Bordering the  \nSanctuary,1435 sq.km. area has been declared as  \nGahirmatha Marine Wildlife Sanctuary in 1997 and  \nit covers two reserve forest blocks of  Mahanadi delta",
    "mangroves comprising 27 sq.km. Gahirmatha Sea  \nbeach is the largest rookery for Olive Ridley Sea  \nTurtles in the world.",
    "Orissa is very rich in floral diversity and some  \nof the threatened taxon of plants of Orissa. Orissa is  \nrich in Orchid flora. Out of  1200 sp. found in India,  \n130 species of Orchid are found in Orissa. Five non-  \ndomesticated rice species are also found in Orissa.  \nOrissa harbours very rich vertebrate and invertebrate  \nfauna. Many threatened taxon of wildlife (Appendix-  \nI) as per IUCN Red Data Book/Schedule-I of Wildlife6 \nAct, 1972 are found in the state and they comprise",
    "17 species reptiles, 15 sp. of  birds, and 22 sp. of  \nmammal., they may be considered threatened and  \nrequire conservation measures. The Chilika and  \nmangrove crab, Scylla serata is also highly exploited.  \nThe tasar silkworms Antheraea mylitta and Antheraea  \npaphia are found in the wild and are also domesticated  \nin Orissa. They have commercial importance. There  \nis paucity of data on invertebrate fauna of Orissa.",
    "Data on aquatic invertebrates and terrestrial -arboreal  \ninvertebrates especially, butterflies, moths, wasps,  \nbees, beetles etc. are available. The soil Oligochaete  \nfauna is rich. \nWildlife in Orissa: \nThe important wild animals found are the  \nElephant, Tiger, Panther, Wild buffalo, Wild boar,  \nBear, Sambar, Spotted Deer, Black buck, Langur,  \nMyna, Parakeet, Hornbill, Woodpeckar, Sea turtles  \nespecially Olive Ridleys, Hawksbill Salt water",
    "especially Olive Ridleys, Hawksbill Salt water  \nCrocodile, Muggar, Gharial, Python, King cobra,  \nCobra, Viper, kraits, Chameleon, Monitor lizards,  \nIrrawady Dolphin, Striped dolphin, Bottlenose  \ndolphin, Finless Porpoise, Whale, Whale shark, Horse-  \nshoe crabs, Chilika crab, Tiger prawns, Fresh water  \nterrapins, butterflies, spiders etc."
  ],
  "created_at": "2025-10-09 00:11:36.310057"
}