{
  "document_id": "31fee3c6-c005-4fa0-a67d-b5816704e285",
  "chunks": [
    "Abstract:  \nCustomers will be able to reserve their vehicles from anywhere in the world due to the Car Rental \nSystem. Consumers provide information to this application by filling in their personal information. When \na consumer creates an account on the website, he or she can reserve a car. The proposed system is an \nonline system that is fully integrated. It effectively and efficiently automates manual procedures.",
    "Customers are aided by this automated method, which allows them to fill in the specifics according to \ntheir needs. It contains information on the sort of car they want to hire as well as the location. The goal \nof this system is to create a website where customers can book their automobiles and request services \nfrom anywhere in the world.  \n \nIntroduction: \nThere are three phases to this car rental system.",
    "1)   The first phase entails organizing car rental locations into pools and allowing pooled car rental \noutlets to share a fleet of automobiles. \n2)   The  second phase  for  each  pool  determines  the  types  and  quantities  of  cars  to  be  acquired  \nand  delivered to  the  auto manufacturer, as well as the geographic redistribution of automobiles \namong pools across the long-term planning horizon.",
    "3)   The third phase entails day-to-day operations, during which the fleet's deployment within each pool \nand among its locations is determined. \n \nA.  Need for Car Rental System \nNowadays, there is Online Car Rental, which benefits users greatly. A rental service is one where \ncustomers come to seek the rental of a rental unit. It is more convenient than paying for the unit's \nownership and maintenance. A car rental company lends autos for a price for a few hours, a few days, or",
    "a week or more. \nB.  Objective of Car Rental System \nThe project's goal is to automate vehicle rental and reservation so that clients don't have to waste time \ncalling and waiting for a vehicle. To convert the manual car rental procedure into a digital method.  \nC. Project Framework \nA framework is a set of defined concepts, techniques, and criteria for dealing with a certain type of \nproblem that may be used as a guide for approaching and resolving future challenges of the same sort.",
    "D.  Data and Information \nData gathering plays a vital function in a project's succession and also it plays an unavoidable role in the \ntimely completion of the project. The project's data comprises the clients' contact information as well as",
    "their feedback/complaints, which are saved in a database. Only the admin has access to the information \ngiven by the clients in order to ensure security. \n \nRELATED WORK: \nA.  Problem Statement \nA car rental is a vehicle that may be rented for a price and utilized for a specific length of time. Getting a \nrental automobile makes it easier for people to travel around when they don't have access to their own",
    "vehicle or don't own one at all. A person who needs transportation must call a rental car company and \nsign a contract. This method improves client retention while also making car and employee \nmanagement more straightforward. \nB.  Proposed Solution \nCreate a web-based system that allows consumers to register and reserve automobiles online while also \nallowing the firm to manage its car rental business efficiently. To make the process of renting an \nautomobile easier for consumers.",
    "automobile easier for consumers. \nC.  Scope and Features \nThis project covers a wide range of topics, from business concepts to computer science, and it \nnecessitates the completion of numerous studies in order to meet the project's objectives. \nD. Functional Requirements \nFunctional requirements are those that are used to demonstrate the system's internal functioning \nnature, as well as the system's description and explanation of each subsystem. It comprises the task that",
    "the system should accomplish, the processes involved, the data that the system should contain, and the \nuser interfaces. \nThe functional requirements are: \n1)   Customer registration – New users should be able to register online and print membership cards. \n2)   Car reservation online – Customers should be able to utilize the system to book and reserve \nautomobiles online. \n3)   Automatic database update once a reservation is made or a new customer is registered – The system",
    "should be able to update the database without any further effort from the administrator whenever a \nnew reservation or registration is made. \nE.  Non-functional Requirements \nIt describes system elements that are concerned with how the system fulfills functional requirements. \nThey are as follows: \n1)  Security – Only authorized corporate workers may get access to the firm's secured page on the \nsystems, and only users with proper passwords and usernames can log in to see the users page.",
    "2) Performance and Response Time – The system should have a high-performance rate while executing \nuser input and should be able to offer feedback or a response in a short amount of time. \n3) Error Handling – Errors should be avoided as much as possible, and a suitable error message should \nbe supplied to help the user through the recovery process.  \n4) Availability – This system must be accessible at all times, 24 hours a day, seven days a week. In a",
    "system failure, the system should be back up and running within 1 to 2 business days, ensuring that the \nbusiness process is not disrupted. \n5)   Ease of Use – Given the consumers' level of understanding, a basic yet high-quality user interface \nshould be created to make it simple to comprehend and need minimal training. \n \nER MODEL:",
    "RELATIONSHIP MODEL: \n \n CONCLUSION: \nIn comparison to previous experiences, when every activity related to the vehicle rental business was \nrestricted to a physical place alone, the car rental industry has emerged with new delicacies. Even if the \nphysical location has not been completely eliminated, the internet's power has altered the nature of \nfunctions and how these tasks are accomplished. Customers may now book vehicles online, rent",
    "automobiles online, and have the car delivered to their home if they are registered members, or they \ncan travel to the office to pick up the car."
  ],
  "created_at": "2025-10-12 14:48:11.703158"
}