{
  "document_id": "8bae6ec5-7ca1-4db9-8a4d-9c90c079ee85",
  "chunks": [
    "Om Prakash Mohanta\nPune | 7684033030 | pikunmohanta50@gmail.com | LinkedIn | Github\nPROFESSIONAL SUMMARY\nInnovative Computer Science graduate specialising in Data Science with hands-on experience in AWS cloud operations. \nDemonstrated expertise in automation, cost optimisation, and machine learning, with a track record of reducing \noperational costs and developing advanced predictive models.\nWORK EXPERIENCE\nGoDigit Life Insurance\nPune,Maharashtra\nGraduate Trainee Engineer - Cloud Team\n -",
    "Graduate Trainee Engineer - Cloud Team\n - \nJun 2024\nPresent\nAutomated AWS infrastructure tasks using Lambda, CloudFormation, and Bash scripts, reducing manual effort by \n40% and improving deployment speed.\nBuilt and maintained CI/CD pipelines with Bitbucket, enabling faster and more reliable application deployments \nacross environments.\nReduced cloud operational costs by $5000/month through cost optimisation techniques using AWS Trusted Advisor \nand Cost Explorer.",
    "and Cost Explorer.\nStrengthened cloud security by implementing MFA, OTP-based authentication, and managing access through IAM \nroles and policies.\nEDUCATION\nCV Raman Global University\nBhubaneswar\nB.Tech Computer Science (Data Science) | 8.53\nGraduation Date: May 2024\nTsg Gurukul\nBhubaneswar\nXII (CBSE) | 72%\nGraduation Date: Mar 2020\nPROJECT EXPERIENCE\nProject 1\nBhubaneswar\nNews Authenticator\n - \nAug 2023\nDec 2023",
    "News Authenticator\n - \nAug 2023\nDec 2023\nDesigned and implemented a distributed news authentication system to detect fake news with 95% accuracy\nImplemented Passive Aggressive Classifier and TF-IDF Vectorizer for advanced content verification\nCollaborated with a four-member team to collect and annotate datasets, ensuring model reliability\nProject 2\nBhubaneswar\nHouse Price Forecaster\n - \nFeb 2023\nApr 2023\nEnhanced housing price prediction accuracy by 5% using advanced regression techniques",
    "Managed a comprehensive dataset of 79 variables, performing rigorous data cleansing and imputation\nApplied ensemble methods including random forest and boosted trees with cross-validation\nSKILLS\nCloud Technologies: AWS Trusted Advisor, Access Management, Cost Optimization\nProgramming & Data Science: Java, Python, Flask, SQL, Machine Learning, Scikit-learn, NLP, TF-IDF, Linear \nRegression\nTools: Bitbucket, Jira, Git\nACCOMPLISHMENT",
    "Research Publication:\nPublished research in IEEE Xplore on Fake News Detection, achieving a 95% accuracy rate. Contributed to NLP \nadvancements by implementing the Passive Aggressive Classifier and TF-IDF Vectorizer.\nEnhanced housing price predictions by 5% using ensemble techniques and advanced cross-validation."
  ],
  "created_at": "2025-10-17 00:53:34.786646"
}