{
  "document_id": "e3ec63e5-7bf7-4f4c-bdd1-ee2257ef4685",
  "chunks": [
    "Om Prakash Mohanta\n 7684033030\n# pikunmohanta50@gmail.com\n§ PikunMohanta\nï om-prakash-mohanta\nProfessional Summary\nInnovative Computer Science graduate specialising in Data Science with hands-on experience in AWS cloud operations.\nDemonstrated expertise in automation, cost optimisation and machine learning, with a track record of reducing operational\ncosts and developing advanced predictive models.\nEducation\nC. V. Raman Global University\nJuly 2020 – May 2024",
    "July 2020 – May 2024\nB.Tech in Computer Science (Data Science), CGPA: 8.53\nBhubaneswar, India\nTsg Gurukul\nJune 2018 – March 2020\nClass XII (CBSE), 72%\nBhubaneswar, India\nTechnical Skills\nCloud: AWS (EC2, S3, EKS, Control Tower, IAM, Trusted Advisor, Cost Optimization)\nProgramming: Java, Python, SQL\nData Science: Flask, Machine Learning, Scikit-learn, NLP, TF-IDF, Regression\nTools: Bitbucket, Git, Jira, F5\nExperience\nGoDigit Life Insurance\nJun 2024 – Present",
    "GoDigit Life Insurance\nJun 2024 – Present\nGraduate Trainee Engineer - Cloud Team\nPune, India\n– Automated AWS tasks using Lambda, CloudFormation, and Bash, improving deployment speed by over 40% and reducing\nmanual effort.\n– Set up AWS Control Tower for centralized governance, streamlining login processes and enforcing secure access and compliance.\n– Optimized core AWS services (EC2, S3, EKS) by removing unused resources, saving approximately $5000 per month.",
    "– Implemented security best practices including MFA, IAM roles, OTP-based login, and IP-restriction policies for secure access.\n– Configured F5 to apply rate limiting and custom rules for partner-specific traffic control and IP allowlisting.\n– Built CI/CD pipelines in Bitbucket to automate deployment workflows, boosting development speed and delivery reliability.\nProjects\nNews Authenticator\nAug 2023 – Dec 2023",
    "Projects\nNews Authenticator\nAug 2023 – Dec 2023\n– Developed a fake news detection system with 95% accuracy using Passive Aggressive Classifier and TF-IDF Vectorizer.\n– Collaborated in a 4-member team to collect, clean, and annotate real-world news datasets for training and evaluation.\n– Built a Flask-based web app for real-time news authenticity checks with integrated model inference pipeline.\nHouse Price Forecaster\nFeb 2023 – Apr 2023",
    "House Price Forecaster\nFeb 2023 – Apr 2023\n– Enhanced prediction accuracy by 5% using ensemble models like XGBoost and Random Forest with rigorous cross-validation.\n– Cleaned and processed a dataset with 79 variables, applying imputation, normalization, and feature selection techniques.\n– Visualized results and feature importances using Matplotlib and SHAP to interpret model predictions clearly.\nAccomplishments\nFake News Detection Using PAC & Neural Network: A Hybrid Approach",
    "– Published a research paper in IEEE Xplore on Fake News Detection achieving 95% accuracy using NLP and TF-IDF.\n– Improved house price predictions by 5% using Random Forest and Boosted Trees with thorough cross-validation.\n– Successfully implemented AWS cost optimization strategies, reducing monthly cloud expenses by 20%."
  ],
  "created_at": "2025-10-17 01:12:56.126884"
}