{
  "document_id": "16bf484d-13d0-4f40-89e8-35610941af9f",
  "chunks": [
    "Fake News Detection Using Passive Aggressive\nClassifier (PAC) & Neural Network: A Hybrid\nApproach\nOm Prakash Mohanta\nComputer Science and Engineering\nC.V. Raman Global University\nBhubaneswar, India\npikunmohanta50@gmail.com\nGourav Swain\nComputer Science and Engineering\nC.V. Raman Global University\nBhubaneswar, India\ngouravswain03@gmail.com\nKumar Ashutosh\nComputer Science and Engineering\nC.V. Raman Global University\nBhubaneswar, India\nkumarashutosh7917@gmail.com\nArpit Padhy",
    "kumarashutosh7917@gmail.com\nArpit Padhy\nComputer Science and Engineering\nC.V. Raman Global University\nBhubaneswar, India\narpit.padhy789@gmail.com\nSampa Sahoo\nComputer Science and Engineering\nC.V. Raman Global University\nBhubaneswar, India\nsampaa2004@gmail.com\nAbstract—In this digital age, the proliferation of fake news\nrepresents a significant challenge. Our research introduces a\nhybrid detection system that employs an optimized Passive Ag-",
    "gressive Classifier (PAC), fine-tuned through various parameters,\nalongside Artificial Neural Networks (ANN). This enhanced PAC\nis designed to identify and counteract misinformation on social\nmedia and anonymous websites. By analyzing articles verified by\nfact-checkers, the system accurately pinpoints linguistic signs of\nfake news, ensuring precise content classification. Our initiative\nsupports informed public dialogue by providing immediate de-",
    "tection and rationale for content identified as potentially false.\nTrained on a comprehensive dataset that includes text, titles, and\nauthorship, our robust framework adeptly evaluates the veracity\nof online articles. Through the application of advanced machine\nlearning and natural language processing techniques, we tackle\nthe rapid spread of false information, aiming to protect the\ndigital information sphere and guarantee access to dependable\nand accurate news.",
    "and accurate news.\nIndex Terms—Fake News Detection, Passive Aggressive Clas-\nsifier, Neural Networks, Natural Language Processing, Machine\nLearning\nI. INTRODUCTION\nIn an age dominated by the omnipresence of social me-\ndia platforms and instant messaging services, distinguishing\nveracity from falsehood has become an increasingly daunting\ntask. Despite the indispensable role of traditional fact-checking\nmethodologies, they often encounter formidable obstacles such",
    "as time constraints and financial limitations [1], which impede\ntheir efficacy in combating the rampant dissemination of mis-\ninformation. This conundrum starkly underscores the urgent\nimperative for pioneering solutions to fortify the integrity of\ninformation in the digital epoch.\nTo confront this multifaceted challenge effectively, it is\nimperative to embark upon a comprehensive and decisive ap-\nproach. Such an approach necessitates the collaborative efforts",
    "of stakeholders from diverse sectors, including technology,\nmedia, academia, and government [2]. Innovative tools and\nplatforms can be developed to empower individuals with the\ncapability to discern fact from fiction amidst the deluge of\ninformation inundating cyberspace. It requires the collective\nefforts of stakeholders from various sectors, including tech-\nnology, media, academia, and government. In response to\nthe pressing need for a dependable means of distinguishing",
    "authentic from false news, our solution harnesses technologies\nsuch as Passive Aggressive Classifiers (PAC), and Artificial\nNeural Networks (ANN). Integrated with the Rapid API, our\nmethodology begins by identifying relevant article URLs and\nemploys advanced feature extraction techniques using PAC\nand ANN combined. This innovative framework offers a rapid\nand robust approach to combating misinformation, crucial for\npreserving information integrity in the digital realm. By lever-",
    "aging state-of-the-art tools and techniques, our solution aims\nto address the escalating challenge of fake news, empowering\nusers to navigate the information landscape with confidence\nand accuracy.\nThe PAC algorithm’s meticulous content classification\nachieves an impressive 98% accuracy, boosting user confi-\ndence and streamlining news article validation. Integration of\nadvanced machine learning and deep learning models enables\nusers to submit links for comprehensive analysis, empowering",
    "informed decision-making to combat digital misinformation\neffectively [3]. This comprehensive strategy not only bolsters\nonline information credibility but also nurtures a more in-\nformed and resilient society amidst widespread misinforma-\ntion. By leveraging cutting-edge technologies and promoting\ncritical thinking, our approach addresses the urgent need for\ndiscerning truth in the digital age, fostering a culture of\naccountability and reliability in information dissemination.",
    "II. LEVERAGING PASSIVE AGGRESSIVE CLASSIFIER AND\nARTIFICIAL NEURAL NETWORKS FOR FAKE NEWS\nDETECTION\nArtificial neural networks (ANNs) are computational models\ninspired by the structure and functionality of biological neural\nnetworks. They consist of interconnected nodes, or neurons,\norganized into layers, with each neuron performing simple\ncomputations. ANNs are trained using algorithms that adjust\nthe weights and biases of connections between neurons to",
    "minimize the difference between predicted and actual outputs.\nPassive Aggressive (PA) classifiers belong to a family of\nonline learning algorithms, adept at handling classification\ntasks where data arrives in chunks or streams [4]. Unlike\ntraditional algorithms, PA classifiers do not maintain a constant\nlearning rate; instead, they adjust based on the accuracy of the\nclassification.\nThe PA algorithm’s unique name derives from its behaviour",
    "when it classifies a sample correctly, it remains ’passive,’\nmaking minimal changes. However, upon misclassification,\nit turns ’aggressive,’ updating its parameters to correct the\nmistake. This adaptive nature makes PA particularly suitable\nfor dynamic environments where data distributions might\nchange over time, such as news streams.\nOriginally devised for text categorization tasks, the PA\nalgorithm has gained traction in fake news detection due to its",
    "ability to handle large datasets efficiently [5]. By iteratively\nprocessing data and updating model parameters based on the\nmost recent examples, PA ensures adaptability and accuracy,\nessential for discerning subtle nuances between genuine and\nfabricated news content.\nA. Mathematical Model Of Passive-Aggressive Classifier\nThe foundational concept behind the PA classifier is its\nadaptive learning mechanism. When a news article’s features\nare fed into the model, it classifies the content based on",
    "the current model parameters. If correct, the model remains\npassive; if incorrect, it adjusts its parameters aggressively to\nrectify the error. Mathematically, the update rule for the PA\nalgorithm can be expressed as:\nω = ω + α ∗(y −ˆy) ∗x\n(1)\nω represents the weight vector.\nα is the learning rate, which can adapt based on the model’s\nperformance.\ny is the true label, and ˆy is the predicted label.\nx is the feature vector of the news article.",
    "x is the feature vector of the news article.\nFor fake news detection, this process continues iteratively,\nensuring that the model fine-tunes itself based on incoming\ndata. The classifier’s efficiency lies in its ability to swiftly\nadapt to changing patterns, making it a robust tool in the fight\nagainst misinformation.\nB. Mathematical Model Of Artificial Neural Network\nA mathematical model of an artificial neural network (ANN)\nis crucial for understanding its behavior, training process, and",
    "predictive capabilities. ANNs are computational models in-\nspired by biological neural networks in the human brain. They\nconsist of interconnected nodes, called neurons, organized into\nlayers. The mathematical model of an ANN typically involves\ndefining the architecture, activation functions, weights, biases,\nand the learning algorithm.\nyl\ni = f\n\nX\nj\nwl\nij · yl−1\nj\n+ bl\ni\n\n\n(2)\nyl\ni is the output of neuron i in layer l.\nf is the activation function.\nwl",
    "f is the activation function.\nwl\nij is the weight of the connection between neuron\ni in layer l, and neuron j in layer l −1.\nyl−1\nj\nis the output of neuron j in the previous layer.\nbl\ni is the bias term for neuron i in layer l.\nC. Literature Study\nVitaly Klyuev and his colleagues conducted a comprehen-\nsive examination of various approaches for detecting fake\nnews, focusing on semantic analysis through natural language\nprocessing (NLP) and text mining methodologies. Addition-",
    "ally, they explored strategies for automated verification and\nidentification of bots within social media platforms [6]. In\ncontrast, Oshikawa and collaborators presented a survey ex-\nclusively centred on fake news detection methodologies, with\na specific emphasis on scrutinizing NLP-based techniques [7].\nMeanwhile, Collins and colleagues delved into the diverse\nmanifestations of fake news, exploring a range of its iterations.\nAdditionally, they examined contemporary strategies aimed at",
    "curbing the dissemination of fake news across social media\nplatforms [8]. Mariana Caravanti de Souza’s PU-LP Algorithm\nemploys a limited set of labeled fake news to classify content,\nachieving state-of-the-art results through a network-based ap-\nproach and semi-supervised learning [9].\nTABLE I\nDATASET COMPARISON TABLE\nName Of Dataset\nDomain\nConcept\nNo of class\nFake or real news\n[10]\nPolitics, Society\nText\n2\nLIAR [11]\nPolitics\nText\n6\nBREAKING! [12]\nSociety,Politics\nText,Image\n2,3\nStanford\nFake",
    "Society,Politics\nText,Image\n2,3\nStanford\nFake\nNews [13]\nSociety\nText,Image\n2\nBuzzFace [14]\nPolitics,Society\nText\n4\nFacebookHoax [2]\nScience\nText\n2\nFact-Checking [15]\nPolitics,Society\nText\n5\nISOT [16]\nBusiness,Crime\nText\n2\nFakeHealth [17]\nHealth\nText\n2\nIftikhar Ahmad’s paper underscores the importance of de-\ntecting counterfeit news due to its extensive impacts on sectors",
    "like politics and financial markets. Additionally, it highlights\nhow ensemble techniques can enhance the accuracy of fake\nnews categorization. This collection of research reflects a\nmultifaceted exploration of fake news detection methods [18].\nIn TABLE I, various datasets used by researchers is presented.\nThe datasets were compared based on concept type, domain\nand number of classes.\nISOT: Comparing Reuters’ real news with fake news from\nsites marked by PolitiFact and Wikipedia [16].",
    "sites marked by PolitiFact and Wikipedia [16].\nLIAR: A collection of 12,836 political statements from\nonline streaming and social media platforms (Twitter and\nFacebook) between 2007 and 2016 [11].\nBREAKING!:A dataset derived from the Stanford Fake\nNews dataset and the BS detector dataset, containing web-\nbased news about the 2016 US presidential election [12].\nStanford Fake News: A dataset of fake news and satire\nstories, featuring exaggerated praise or criticism of a person,",
    "conspiracy theories, racist themes, and attacks on credible\nsources [13].\nBuzzFace A dataset of 2263 news articles and 1.6 million\ncomments on Facebook about social and political issues from\nJuly 2016 to December 2016. This dataset was updated in\nSeptember 2016 [14].\nFacebookHoax: A dataset of 15,500 science-related hoaxes\non Facebook from July 2016 to December 2016. This dataset\nalso tracks posts with more than 2.3 million likes [2].\nIII. IMPLEMENTATION DETAILS",
    "III. IMPLEMENTATION DETAILS\nIn relation to the workflow illustrated in Fig. 1, we provide\nan overview of our proposed framework, followed by detailed\ndescriptions of algorithms utilized, datasets employed, and the\nmetrics employed for performance evaluation.\nA. About Dataset\nThis study leveraged a dataset sourced from Kaggle [10],\nencompassing 20,800 articles categorized as either fake or\nreal news. The dataset we have gathered includes critical at-",
    "tributes such as textual content, title, and author’s name, which\nserve as foundational elements for subsequent analysis and\nmodel training. Data Exploration and Preprocessing: Initial\ndataset exploration revealed anomalies, such as missing values,\naddressed through meticulous data-cleaning procedures. The\ndataset exhibited an equitable distribution, with 50% fake news\nand 50% genuine articles, enhancing its reliability. Model\nEvaluation Dataset Split: The dataset was systematically split",
    "into training (80%) and testing (20%) sets, ensuring a robust\nevaluation of machine learning models. Stratified sampling\nmethods maintained a consistent proportion of fake and real\nnews articles across both subsets.\nB. Data Loading and Preprocessing\nThe dataset from Kaggle comprises 20,800 articles labeled\nas fake or real news, featuring text, title, and author attributes.\nThis dataset includes attributes such as text, title, and author\ninformation. Addressing missing values and duplicates, we",
    "ensured data integrity through thorough cleaning and NLP\ntechniques like tokenization and stop-word removal [19].\nFeature engineering extracted key elements like linguistic\nand social context, aiding in categorizing credibility. Using\nstratified sampling, the dataset is divided into 80% training\nand 20% testing sets for balance model evaluation.\nFig. 1. Workflow Model\nC. Text Tokenization and Padding\nWe used the NLTK library for text tokenization, converting",
    "raw data into unigrams to efficiently capture word frequencies\n[20]. To handle varied text lengths, we applied zero padding,\nstandardizing sequences to a 300-word maximum. This ap-\nproach balanced preserving article content while ensuring\nuniformity for machine learning model compatibility.\nD. Converting Text to Vectors\nIn the context of the Passive Aggressive algorithm, the\nconversion of text into numerical vectors is a crucial prepro-",
    "cessing step for classification tasks. This process is facilitated\nby the utilization of CountVectorizer, a technique employed\nby the Passive Aggressive Classifier (PAC). CountVectorizer\ntransforms textual documents into numerical representations\nby tabulating the frequency of occurrence of each word.\nThese numerical vectors serve as the input for the algorithm,\nenabling it to discern patterns and make informed predictions\nbased on the textual features. By employing this method, the",
    "PAC algorithm efficiently analyzes text data, contributing to\nits effectiveness in various applications such as fake news\ndetection and sentiment analysis.",
    "E. PAC Model Creation\nThe Passive-Aggressive (PA) Classifier is an online learning\nmethod used for binary classification tasks. Unlike traditional\nmodels, it doesn’t store past data. Instead, it adapts dynam-\nically based on prediction outcomes. When predictions are\ncorrect, it remains passive; when errors occur, it becomes\naggressive and adjusts model parameters. Key hyperparam-\neters include the regularization parameter, which controls",
    "aggressiveness, and the maximum number of iterations. PA is\nefficient for real-time applications and handles evolving data\npatterns effectively [21].\nF. ANN Model Creation\nFig. 2. Architecture of the Sequential ANN\nArtificial Neural Networks (ANNs) simulate the human\nbrain, performing tasks like image recognition, natural lan-\nguage processing, and pattern detection. These networks\nconsist of interconnected nodes (artificial neurons) in input,",
    "hidden, and output layers. Each node processes input using\nweights, biases, and activation functions. Our project im-\nplemented a sequential ANN to process text inputs through\nan 8-dimensional matrix. It included bidirectional layers to\ncapture dependencies in both directions. Dropout layers pre-\nvented overfitting. Two dense layers with Rectified Linear Unit\n(ReLU) activations aided pattern recognition, and the final\noutput layer used a sigmoid activation function. Optimized",
    "with the Adam optimizer and binary cross-entropy loss, the\nmodel had over fifty thousand trainable parameters. [5]. In Fig.\n2 provides a visual representation of this ANN architecture,\nillustrating the various layers and their connections. The\nembedding layer, bidirectional layers, and dense layers are\nclearly depicted, emphasizing the flow of information through\nthe network. .\nG. Fake News Detection & User Interaction via Flask Frame-\nwork",
    "work\nDeveloped a Flask web application that combines advanced\nmachine learning methods with a user-friendly interface for\nFake News Detection. Utilizing the Passive Aggressive Clas-\nsifier (PAC) and CountVectorizer, users can enter news article\nURLs to check their validity. The application is enhanced by\nHTML, CSS, and libraries such as Flask, nltk, and scikit-\nlearn, offering a visually appealing interface and smooth\nfunctionality. An integral feature of this tool is its interactive",
    "dashboard, which presents a comprehensive figure of the user\ninterface, referred to as Fig. 3. This figure illustrates the\nprocess flow from URL entry to validity assessment, including\nvisual cues for classification results and statistical insights into\nthe data analyzed. Demonstrating our commitment to fighting\ndigital misinformation, we provide users with a reliable and\nstraightforward solution. In our proposed framework, depicted\nFig. 3. User Interface",
    "Fig. 3. User Interface\nin Fig. 1, we aim to advance existing research by integrating\nensemble techniques alongside diverse linguistic feature sets\n[22].This innovative approach is tailored for the classification\nof news articles originating from diverse domains, distinguish-\ning between genuine and fabricated content.\nH. Implementation of Rapid API\nRapid API presents developers with a versatile platform that\nfacilitates the seamless integration of various APIs, spanning",
    "cybersecurity and threat intelligence services. Although not\nspecifically tailored to fake website detection, its suite of tools\noffers invaluable insights into the reputation and vulnerabilities\nof websites [23]. By integrating with Rapid API, our system\ngains access to real-time data and analytics, empowering users\nto make informed assessments of website legitimacy. This\nintegration not only enhances online security measures but\nalso equips users with the necessary tools to navigate the",
    "digital landscape with confidence, mitigating risks associated\nwith fraudulent websites and bolstering overall cyber defense\nstrategies.\nI. Output\nThe output of this process is the classification of each news\narticle: Fake News: If the combined prediction leans toward\nfake. Real News: If the combined prediction leans toward\nreal. In summary, by checking URL reliability, preprocessing\ndata, and leveraging both ANN and PAC models, we aim\nto accurately classify news articles as fake or real. The",
    "combination of these models enhances the overall prediction\nperformance.",
    "IV. RESULTS\nAssessing the effectiveness of algorithms involved the uti-\nlization of various metrics, primarily derived from the confu-\nsion matrix. This matrix serves as a structured representation\nof a classification model’s performance on the test dataset, en-\ncapsulating four key parameters: true positives, false positives,\ntrue negatives, and false negatives.\nA. Accuracy\nAccuracy is a performance metric used to evaluate the effec-",
    "tiveness of a classification model. It measures the proportion of\ncorrectly classified instances out of all instances in the dataset.\nB. Precision\nPrecision is a performance metric used in binary classi-\nfication tasks that measures the proportion of true positive\npredictions among all positive predictions made by the model.\nIt indicates the model’s ability to avoid false positives.\nC. Recall\nRecall signifies the entirety of positive classifications among",
    "the true class. In our context, it denotes the count of articles\nforecasted as true relative to the overall count of true articles.\nD. F1 Score\nThe F1 Score encapsulates the balance between precision\nand recall, computing the harmonic mean of both metrics. By\nconsidering both false positive and false negative observations,\nit provides a comprehensive assessment. The F1 Score can be\ndetermined using the following formula:\nE. Findings\nFig. 4. Accuracy Comparison",
    "E. Findings\nFig. 4. Accuracy Comparison\nIn our study, we have employed a modified Passive Ag-\ngressive Classifier (PAC) that has been fine-tuned for optimal\nperformance, resulting in a superior accuracy rate compared\nto the standard PAC. This meticulous optimization under-\nscores our commitment to precision and the reliability of\nour fake news detection system. As depicted in Fig. 4. the\naccuracy comparison of different models is presented, with",
    "our enhanced PAC achieving a remarkable 98% accuracy,\ndemonstrating its robust predictive capabilities and its pro-\nficiency in making accurate predictions on unfamiliar data.\nAdditionally, the Artificial Neural Network (ANN) achieved\nan accuracy of 97.73%, and the combined PAC and ANN\napproach yielded an accuracy of 97.30%. The CNN model,\nincluded for comparative purposes, attained an accuracy of\n97%, thereby affirming the effectiveness of our system across\nvarious methodologies.",
    "various methodologies.\nIn TABLE II, a comparison is made between the Passive Ag-\ngressive Classifier (PAC), Artificial Neural Network (ANN),\nCNN, and the combined model in terms of accuracy, precision,\nrecall, and F1 Score:\nTABLE II\nMODELS COMPARISON TABLE\nModel\nAccuracy\nPrecision\nRecall\nF1 Score\nPAC\n98%\n0.98\n0.97\n0.98\nANN\n97%\n0.98\n0.96\n0.97\nCNN\n95%\n0.95\n0.98\n0.97\nPAC+ANN\n97.3%\n0.96\n0.98\n0.97\nFig. 5. illustrates the confusion matrices for the Passive",
    "Aggressive Classifier (PAC), the Artificial Neural Network\n(ANN), and the combined PAC+ANN model. These matrices\nprovide a visual representation of the performance of each\nmodel, detailing the number of correct and incorrect predic-\ntions made, thus offering insights into the true positive, false\npositive, true negative, and false negative rates of classification.\nSpecifically, we observed a high number of true positives\nand true negatives, indicating the model’s ability to correctly",
    "classify both positive and negative instances. However, we\nalso noted some false positives and false negatives, albeit at\na notably lower frequency. These errors suggest areas where\nthe model may benefit from further refinement, potentially\nthrough feature engineering or fine-tuning of hyperparame-\nters. Nonetheless, the overall performance, as indicated by\nthe confusion matrix, underscores the efficacy of our model\nin accurately predicting class labels. Such insights gleaned",
    "from the confusion matrix serve as invaluable feedback for\noptimizing our model and enhancing its predictive capabilities\nin real-world applications.\nV. CONCLUSION\nThe quest to identify and mitigate fake news is increasingly\nchallenging due to the dynamic and sophisticated nature\nof misinformation, especially with the rise of AI-generated\ncontent. Our research contributes to this ongoing battle by\nintroducing a hybrid detection model that integrates Passive",
    "Aggressive Classifiers and Artificial Neural Networks. This\nrobust framework is trained on an extensive dataset, encom-\npassing text, titles, and authorship, to accurately assess the\nauthenticity of online articles. Through meticulous prepro-\ncessing, feature engineering, and dimensionality reduction, we\nsignificantly enhance the quality of our data.The incorporation\nof Rapid API’s diverse services further empowers our model,\nenabling sentiment analysis, topic modeling, and rigorous fact-",
    "checking.\nLooking ahead, our focus is on fortifying AI’s discernment\nthrough advanced natural language processing and machine",
    "Fig. 5. Confusion Matrix Of PAC, ANN & PAC+ANN\nlearning techniques, particularly for multimedia content. The\ndevelopment of real-time verification tools is paramount, serv-\ning as a linchpin in the rapid authentication of news and\ncurtailing the spread of misinformation. In this regard, we aim\nnot only to enhance the accuracy of fake news detection but\nalso to safeguard the integrity of journalism and elevate the\nquality of public discourse.\nREFERENCES",
    "quality of public discourse.\nREFERENCES\n[1] Z. Qu, Y. Meng, G. Muhammad, and P. Tiwari, “Qmfnd: A quantum\nmultimodal fusion-based fake news detection model for social media,”\nInformation Fusion, vol. 104, p. 102172, 2024.\n[2] J. Golbeck, M. Mauriello, B. Auxier, K. H. Bhanushali, C. Bonk, M. A.\nBouzaghrane, C. Buntain, R. Chanduka, P. Cheakalos, J. B. Everett et al.,\n“Fake news vs satire: A dataset and analysis,” in Proceedings of the 10th\nACM conference on web science, 2018, pp. 17–21.",
    "ACM conference on web science, 2018, pp. 17–21.\n[3] X. Fang, H. Wu, J. Jing, Y. Meng, B. Yu, H. Yu, and H. Zhang, “Nsep:\nEarly fake news detection via news semantic environment perception,”\nInformation Processing & Management, vol. 61, no. 2, p. 103594, 2024.\n[4] G. Pennycook and D. G. Rand, “The psychology of fake news,” Trends\nin cognitive sciences, vol. 25, no. 5, pp. 388–402, 2021.\n[5] P. Przybyla, “Capturing the style of fake news,” in Proceedings of the",
    "AAAI conference on artificial intelligence, vol. 34, no. 01, 2020, pp.\n490–497.\n[6] D. M. Lazer, M. A. Baum, Y. Benkler, A. J. Berinsky, K. M. Greenhill,\nF. Menczer, M. J. Metzger, B. Nyhan, G. Pennycook, D. Rothschild\net al., “The science of fake news,” Science, vol. 359, no. 6380, pp.\n1094–1096, 2018.\n[7] V. Klyuev, “Fake news filtering: Semantic approaches,” in 2018 7th\nInternational Conference on Reliability, Infocom Technologies and Op-\ntimization (Trends and Future Directions)(ICRITO).",
    "IEEE, 2018, pp.\n9–15.\n[8] R. Oshikawa, J. Qian, and W. Y. Wang, “A survey on natural language\nprocessing for fake news detection,” arXiv preprint arXiv:1811.00770,\n2018.\n[9] M. C. de Souza, M. P. S. Gˆolo, A. M. G. Jorge, E. C. F. de Amorim,\nR. N. T. Campos, R. M. Marcacini, and S. O. Rezende, “Keywords\nattention for fake news detection using few positive labels,” Information\nSciences, vol. 663, p. 120300, 2024.\n[10] “kaggle fake news,” https://www.kaggle.com/competitions/fake-news,",
    "2014, accessed: Date accessed.\n[11] H. Ahmed, I. Traore, and S. Saad, “Detecting opinion spams and fake\nnews using text classification,” Security and Privacy, vol. 1, no. 1, p. e9,\n2018.\n[12] K. Nakamura, S. Levy, and W. Y. Wang, “r/fakeddit: A new multimodal\nbenchmark dataset for fine-grained fake news detection,” arXiv preprint\narXiv:1911.03854, 2019.\n[13] W. Y. Wang, “” liar, liar pants on fire”: A new benchmark dataset for\nfake news detection,” arXiv preprint arXiv:1705.00648, 2017.",
    "[14] K. Shu, D. Mahudeswaran, S. Wang, D. Lee, and H. Liu, “Fakenewsnet:\nA data repository with news content, social context, and spatiotemporal\ninformation for studying fake news on social media,” Big data, vol. 8,\nno. 3, pp. 171–188, 2020.\n[15] A. Vlachos and S. Riedel, “Fact checking: Task definition and dataset\nconstruction,” in Proceedings of the ACL 2014 workshop on language\ntechnologies and computational social science, 2014, pp. 18–22.",
    "[16] H. Ahmed, I. Traore, and S. Saad, “Detection of online fake news using\nn-gram analysis and machine learning techniques,” in Intelligent, Se-\ncure, and Dependable Systems in Distributed and Cloud Environments:\nFirst International Conference, ISDDC 2017, Vancouver, BC, Canada,\nOctober 26-28, 2017, Proceedings 1.\nSpringer, 2017, pp. 127–138.\n[17] E. Dai, Y. Sun, and S. Wang, “Ginger cannot cure cancer: Battling fake\nhealth news with a comprehensive data repository,” in Proceedings of",
    "the International AAAI Conference on Web and Social Media, vol. 14,\n2020, pp. 853–862.\n[18] I. Ahmad, M. Yousaf, S. Yousaf, and M. O. Ahmad, “Fake news\ndetection using machine learning ensemble methods,” Complexity, vol.\n2020, pp. 1–11, 2020.\n[19] J. Harsin, “Oxford research encyclopedia of communication,” 2018.\n[20]\n´A. Figueira and L. Oliveira, “The current state of fake news: challenges\nand opportunities,” Procedia computer science, vol. 121, pp. 817–825,\n2017.",
    "2017.\n[21] E. C. Tandoc Jr, “The facts of fake news: A research review,” Sociology\nCompass, vol. 13, no. 9, p. e12724, 2019.\n[22] J. P. Baptista and A. Gradim, “Understanding fake news consumption:\nA review,” Social Sciences, vol. 9, no. 10, p. 185, 2020.\n[23] M. Verstraete, J. R. Bambauer, and D. E. Bambauer, “Identifying and\ncountering fake news,” Hastings LJ, vol. 73, p. 821, 2022."
  ],
  "created_at": "2025-10-11 12:55:57.350702"
}